docs/posts/2018-02-19-prayer-in-times-of-fear.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Dec 25, 2024 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Prayer in Times of Fear</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/normalize.css' type='text/css'/>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
<link rel='stylesheet' href='/css/syntax-coloring.css' type='text/css'/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="/"> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/index.xml">RSS</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">Prayer in Times of Fear</h1>
<p class="subtitle" role="doc-subtitle">Feb 19, 2018</p>
</header><p>
God of compassion, In this week of violence and tragedy,<br>
we mourn with those who grieve,<br>
cry with those who weep,<br>
and sit in silence with those in pain. 
</p>

<p>
But what should never happen even once<br>
seems to happen over and over again,<br>
until we are left with nothing<br>
but bloodshot eyes and numb hearts. 
</p>

<p>
Even so, Lord, this is our witness: 
</p>

<p>
You are with us,<br>
and in your presence,<br>
We will not be afraid. 
</p>

<p>
We will not fear the world,<br>
for it is your creation. 
</p>

<p>
We will not fear the future,<br>
for you have already redeemed it. 
</p>

<p>
We will not fear the unknown,<br>
for surely you have seen it. 
</p>

<p>
We will not fear the stranger,<br>
for that person was made in your image,<br>
even as we are made. 
</p>

<p>
We will not fear our weakness,<br>
for you will give us strength. 
</p>

<p>
We will not fear the darkness,<br>
For we carry the light with us. 
</p>

<p>
You are there,<br>
and we are not alone. 
</p>

<p>
We will not be afraid. 
</p>

<p>
<i>Amen</i>
</p>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Dec 25, 2024.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
